app/controllers/articles_controller.rb

  def create
    # jika ingin melihat hasil post dari form create, silahkan uncomment code dibawah ini
    # render plain: params[:article].inspect
    @article = Article.new(allow_article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "name", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["name", ""], ["content", ""], ["created_at", "2015-12-30 16:12:18.464811"], ["updated_at", "2015-12-30 16:12:18.464811"]]

  def update
    @article = Article.find(params[:id])
    @article.update(allow_article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = $1, "name" = $2, "content" = $3, "updated_at" = $4 WHERE "articles"."id" = $5  [["title", "asdf"], ["name", "adf"], ["content", "asdf"], ["updated_at", "2016-01-01 16:38:12.918133"], ["id", 1]]